<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://www.moof-it.co.uk</string>
	<key>pfm_description</key>
	<string>moofMacOS </string>
	<key>pfm_domain</key>
	<string>uk.co.moofmacos.settings</string>
	<key>pfm_format_version</key>
	<integer>2</integer>
	<key>pfm_last_modified</key>
	<date>2024-27-09T10:35:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures moofMacOS settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>moofMacOS</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>uk.co.moofmacos.settings</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>uk.co.moofmacos.settings</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Branding</string>
				<string>macOS Upgrades</string>
				<string>macOS Updates</string>
				<string>Enforcement and Other Options</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Branding</key>
				<array>
					<string>logoName</string>
					<string>logoType</string>
				</array>
				<key>macOS Upgrades</key>
				<array>
					<string>upgradeEnabled</string>
					<string>minimumOS</string>
					<string>upgradeDeadline</string>
					<string>jamfPolicy</string>
				</array>
				<key>macOS Updates</key>
				<array>
					<string>updatesEnabled</string>
					<string>updateDeferral</string>
				</array>
				<key>Enforcement and Other Options</key>
				<array>
					<string>enforcementEnabled</string>
					<string>persistentNotification</string>
					<string>blockApps</string>
					<string>gracePeriod</string>
				</array>	
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>upgradeEnabled</string>
			<key>pfm_title</key>
			<string>Enable macOS Upgrades</string>
			<key>pfm_description</key>
			<string>Enable macOS Upgrade Notifications.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>minimumOS</string>
			<key>pfm_title</key>
			<string>Select the minimum target OS upgrade</string>
			<key>pfm_description</key>
			<string>This is the minimum OS version that is allowed. For example if you select Ventura, only devices using a macOS less than Ventura will be prompted to upgrade their device</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_range_list</key>
			<array>
				<integer>13</integer>
				<integer>14</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Ventura</string>
				<string>Sonoma</string>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>upgradeDeadline</string>
			<key>pfm_title</key>
			<string>Upgrade Deadline Date</string>
			<key>pfm_description</key>
			<string>Select an ISO format date to enforce the upgrade.</string>		
			<key>pfm_type</key>
			<string>date</string>
		</dict>		
		<dict>
			<key>pfm_name</key>
			<string>updatesEnabled</string>
			<key>pfm_title</key>
			<string>Enable macOS Updates</string>
			<key>pfm_description</key>
			<string>Enable macOS Update Notifications.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>updateDeferral</string>
			<key>pfm_title</key>
			<string>Update Deferral Days</string>
			<key>pfm_description</key>
			<string>Select the number of days users have to install updates. Can be a minimum of 1 and a maxiumum of 28.</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>7</integer>
			<key>pfm_range_max</key>
			<integer>28</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>enforcementEnabled</string>
			<key>pfm_title</key>
			<string>Enable macOS Update/Upgrade Enforcement</string>
			<key>pfm_description</key>
			<string>Enable enforcement</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>persistentNotification</string>
			<key>pfm_title</key>
			<string>Enable Persistent Notification</string>
			<key>pfm_description</key>
			<string>Enable a persistent notification in the top right corner of the screen. Which informs the user to update their macOS.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>blockApps</string>
			<key>pfm_title</key>
			<string>Applications To Block</string>
			<key>pfm_description</key>
			<string>Specify an app process to block after deadline. Please DO NOT include the path for the process.</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>gracePeriod</string>
			<key>pfm_title</key>
			<string>Update Grace Period</string>
			<key>pfm_description</key>
			<string>Select the number of days a user must see notifications before deadline behaviour begins. Can be a minimum of 0 and a maximum of 7. Please note this does nothing if Enforcement is disabled.</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>7</integer>
			<key>pfm_range_max</key>
			<integer>7</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>logoName</string>
			<key>pfm_title</key>
			<string>Input the name of the image file.</string>
			<key>pfm_description</key>
			<string>Input the name of your image file, for example logo.png. The image must be in PNG format, leaving this field blank will result in the System Settings image being used.</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>logoType</string>
			<key>pfm_title</key>
			<string>Select your logo type.</string>
			<key>pfm_description</key>
			<string>Please select your required image type below:\n\nSquare Logo type image is be recommended the size is 180x180 and in PNG format.\n\nWide Logo type image is recommended to be 1500x320 and in PNG format.</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Square Logo</string>
				<string>Wide Logo</string>
			</array>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>moofMacOS</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>